export const Todo = () => {
  return (
    <>
      <ul>
        <li>Практика задачи алгоритмические</li>
        <li>Практика - смотри собесы</li>
        <li>Практика - SSR</li>
        <li>Практика внедрения jest и playwright</li>
        <li>
          Практика создания проекта webpack, ts, styles, img, fonts, eslint,
          prettier, husky
        </li>
        <li>new react, rtk</li>
        <li>запросы axios, rtk?</li>
        <li>библиотеки ui?</li>
        <li>Фигма</li>
      </ul>
      <ul>
        <li>Теория ОПП</li>
        <li>Теория Алгоритмы</li>
        <li>Теория FSD и другие архитектуры</li>
        <li>Теория Паттерны</li>
        <li>Теория SPA PWA MVP...</li>
        <li>
          Теория Функциональное программирование - чистая функция,
          иммутабельность...
        </li>
        <li>Теория SOLID</li>
        <li>Теория event listener, e</li>
        <li>Теория async, promise</li>
        <li>+Теория ts</li>
        <li>Теория уязвимости</li>
        <li>Теория react new</li>
        <li>Теория redux rtk, state manager</li>
        <li>Теория HTTP REST CORS</li>
        <li>Теория Структуры данные</li>
        <li>Теория Метрики производительности и оптимизация</li>
        <li>Теория webpack</li>
        <li>Теория GRASP, KISS </li>
        <li>CI CD, docker,...</li>
      </ul>
      <ul>
        <li>стартовое резюме для тестовых собесов (так себе идейка)</li>
        <li>Супер резюме на 400+</li>
        <li>
          О себе - опыт, проекты - немного про архитектуру и создание проектов
        </li>
        <li>Собесил и менторил</li>
        <li>Книги читаешь, ютуб смотришь, новые технологии практикуешь</li>
        <li>Почему хочешь уйти</li>
        <li>Что ожидаешь и чего хочешь</li>
      </ul>
    </>
  );
};
